# pandas

In [10]:
import pandas as pd
import numpy as np
pd.__version__

'2.0.3'

# creating SERIES
- In pandas, a Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, etc.). It is similar to a Python list or NumPy array but with additional functionalities. Each element in a Series has a label, called the index. You can think of a Series as a column in a spreadsheet or a single column of data in a DataFrame (which is essentially a collection of Series).

In [4]:
lst =[1,2,3,4,5]
pd.Series(lst)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
arr = np.array(lst)
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int64

#### giving index from our side by default it start from 0

In [9]:
pd.Series(data = ["Rohit","Roshan"],index=[23,25])

23     Rohit
25    Roshan
dtype: object

### series through dict

In [11]:
d = {1:"a",2:"b"}
pd.Series(d)

1    a
2    b
dtype: object

### using repeat function along with creating a series
pandas series.repeat()fun rep elements of a series. 
return a new series where each element of the current series is repeated consecutively a given times.

In [13]:
pd.Series(5).repeat(5)

0    5
0    5
0    5
0    5
0    5
dtype: int64

#### we can use reset_index to get accurate index

In [18]:
pd.Series(5).repeat(5).reset_index()

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [113]:
data = pd.Series([1,2]).repeat([4,2]).reset_index(drop=True)
print(data)

0    1
1    1
2    1
3    1
4    2
5    2
dtype: int64

In [114]:
#  Acccessing Element
data[4]

2

In [118]:

print(data[::-1])

5    2
4    2
3    1
2    1
1    1
0    1
dtype: int64

## Aggregate functions on pands
- pandas Series.aggregate() functions using one or more operations over the specified axis in thegiven series objects .

In [45]:
np.random.seed(9)
arr = np.random.randint(1,10,8,dtype=int)
sr = pd.Series(arr)
print(sr)
sr.agg([min,max,sum])

0    6
1    7
2    9
3    7
4    2
5    7
6    5
7    9
dtype: int64

min     2
max     9
sum    52
dtype: int64

### Series Absolute functions
pandas Series.abs() method is used to get the absolute numeric value of each element in series/Data frame.

In [46]:
s = pd.Series([-1,2,-3,-4,5,-10])
s.abs()

0     1
1     2
2     3
3     4
4     5
5    10
dtype: int64

### Append series
pandas.append() functions is used to concatenate two or more series

In [55]:
sr1 = pd.Series([1,-2,3])
sr2 = pd.Series([1,2,3])

In [58]:
print(sr1._append(sr2))
print("-"*10)
print(sr2._append(sr1))

0    1
1   -2
2    3
0    1
1    2
2    3
dtype: int64
----------
0    1
1    2
2    3
0    1
1   -2
2    3
dtype: int64

### Astype function
it is used to change data type of a series

In [66]:
print(type(sr1[0]))
print(sr1.astype('float'))

<class 'numpy.int64'>
0    1.0
1   -2.0
2    3.0
dtype: float64

### Between functions
used on series to check which value lie between first and last

In [67]:
sr = pd.Series([1,2,3,4,3,6,10,9])
sr.between(1,10)

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
dtype: bool

## All strings functions can be used to extract or modify texts in a series
 - Upper and Lower Function
 - Len function
 - Strip Function
 - Split Function
 - Contains Function
 - Replace Function
 - Count Function
 - Startswith and Endswith Function
 - Find Finction

In [69]:
ser = pd.Series(["Eshant Das" , "Data Science" , "Geeks for Geeks" , 'Hello World' , 'Machine Learning'])
ser

0          Eshant Das
1        Data Science
2     Geeks for Geeks
3         Hello World
4    Machine Learning
dtype: object

In [94]:
print(ser.str.upper())
print("-"*20)
print(ser.str.lower())
print("-"*20)
print(ser.str.len())
print("-"*20)
print(ser.str.strip())
print("-"*20)
print(ser.str.contains('r'))
print("-"*20)
print(ser.str.replace('r','z'))
print("-"*20)
print(ser.str.count('r'))
print("-"*20)
print(ser.str.startswith('D'))
print("-"*20)
print(ser.str.endswith('s'))
print("-"*20)
print(ser.str.find('s'))

0          ESHANT DAS
1        DATA SCIENCE
2     GEEKS FOR GEEKS
3         HELLO WORLD
4    MACHINE LEARNING
dtype: object
--------------------
0          eshant das
1        data science
2     geeks for geeks
3         hello world
4    machine learning
dtype: object
--------------------
0    10
1    12
2    15
3    11
4    16
dtype: int64
--------------------
0          Eshant Das
1        Data Science
2     Geeks for Geeks
3         Hello World
4    Machine Learning
dtype: object
--------------------
0    False
1    False
2     True
3     True
4     True
dtype: bool
--------------------
0          Eshant Das
1        Data Science
2     Geeks foz Geeks
3         Hello Wozld
4    Machine Leazning
dtype: object
--------------------
0    0
1    0
2    1
3    1
4    1
dtype: int64
--------------------
0    False
1     True
2    False
3    False
4    False
dtype: bool
--------------------
0     True
1    False
2     True
3    False
4    False
dtype: bool
--------------------
0    1
1   -1
2    4
3   -1
4   -1
dtype: int64

### split

In [93]:
print("full name : ",ser[0])
print("first name : ",ser.str.split(' ')[0][0])
print("last name : ",ser .str.split(' ')[0][1])

full name :  Eshant Das
first name :  Eshant
last name :  Das

## Converting series to List

In [95]:
ser.to_list()

['Eshant Das',
 'Data Science',
 'Geeks for Geeks',
 'Hello World',
 'Machine Learning']

# DATAFRAME
- Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.
### Creating Data Frames
- In the real world, a Pandas DataFrame will be created by loading the datasets from existing storage, storage can be SQL Database, CSV file, and Excel file. Pandas DataFrame can be created from the lists, dictionary, and from a list of dictionary etc. Dataframe can be created in different ways here are some ways by which we create a dataframe:

### Creating a dataframe using List:

- DataFrame can be created using a single list or a list of lists.

In [100]:
lst = ['Geeks', 'For', 'Geeks', 'is', 'portal', 'for', 'Geeks']
lst = [['tom',10],['jerry',12],['spike',14]]
print(pd.DataFrame(lst))
print("-"*20)
print(pd.DataFrame(lst))

       0   1
0    tom  10
1  jerry  12
2  spike  14
--------------------
       0   1
0    tom  10
1  jerry  12
2  spike  14

### Creating DataFrame from dict of ndarray/lists:

To create DataFrame from dict of narray/list, all the narray must be of same length. If index is passed then the length index should be equal to the length of arrays. If no index is passed, then by default, index will be range(n) where n is the array length.

In [101]:
data = {'name':['Tom', 'nick', 'krish', 'jack'], 'age':[20, 21, 19, 18]}


pd.DataFrame(data)

    name  age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

- A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. We can perform basic operations on rows/columns like selecting, deleting, adding, and renaming.

### Column Selection:

- In Order to select a column in Pandas DataFrame, we can either access the columns by calling them by their columns name.

In [103]:
data = { 'Name'         :['Jai', 'Princi', 'Gaurav', 'Anuj'],
         'Age'          :[27, 24, 22, 32],
         'Address'      :['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
         'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

df = pd.DataFrame(data)

df[['Name', 'Qualification','Age']]

     Name Qualification  Age
0     Jai           Msc   27
1  Princi            MA   24
2  Gaurav           MCA   22
3    Anuj           Phd   32

### Slicing in DataFrames Using iloc and loc
Pandas comprises many methods for its proper functioning. loc() and iloc() are one of those methods. These are used in slicing data from the Pandas DataFrame. They help in the convenient selection of data from the DataFrame in Python. They are used in filtering the data according to some conditions.

In [119]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

#  loc Operations
- Python loc() function The loc() function is label based data selecting method which means that we have to pass the name of the row or column which we want to select. This method includes the last element of the range passed in it, unlike iloc(). loc() can accept the boolean data unlike iloc(). Many operations can be performed using the loc() method like

In [138]:
df.loc[0:1,'one':'three']

   one  two  three
0    1   10    100
1    2   20    200

# iloc Operations
The iloc() function is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column. This method does not include the last element of the range passed in it unlike loc(). iloc() does not accept the boolean data unlike loc().

In [136]:
df.iloc[1:,:]

   one  two  three  four
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

selecting specific row

In [141]:
df.loc[[0,3],['one','four']]

   one  four
0    1  1000
3    4  4000

# slicing using conditions

In [161]:
df.loc[df['two']>=20,['one']]

   one
1    2
2    3
3    4

# Column Addition in DataFrame

In [178]:
ls = [4,3,2,1]
df['five'] = ls
df

   one  two  three  four  five
0    1   10    100  1000     4
1    2   20    200  2000     3
2    3   30    300  3000     2
3    4   40    400  4000     1

## Deleting column

In [179]:
# column deletion in DATAFRAME
del df['five']
print(df)
print('*'*40)
df['five'] = ls
df.pop('five')
print(df)

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
****************************************
   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

# Addition of rows
In a Pandas DataFrame, you can add rows by using the append method. You can also create a new DataFrame with the desired row values and use the append to add the new row to the original dataframe. Here's an example of adding a single row to a dataframe:

In [188]:
df1 = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'])

df3 = df1._append(df2).reset_index(drop=True)
df3

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

In [189]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

# Pandas drop function
Python is a great language for doing data analysis, primarily because of the fantastic ecosystem of data-centric Python packages. Pandas is one of those packages and makes importing and analyzing data much easier.

Pandas provide data analysts a way to delete and filter data frame using .drop() method. Rows or columns can be removed using index label or column name using this method.

Syntax: DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors=’raise’)

Parameters:

labels: String or list of strings referring row or column name. axis: int or string value, 0 ‘index’ for Rows and 1 ‘columns’ for Columns. index or columns: Single label or list. index or columns are an alternative to axis and cannot be used together. level: Used to specify level in case data frame is having multiple level index. inplace: Makes changes in original Data Frame if True. errors: Ignores error if any value from the list doesn’t exists and drops rest of the values when errors = ‘ignore’

Return type: Dataframe with dropped values
- axis
    - Row -> 0
    - column -> 1

In [204]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [205]:
df.drop([0,1],axis=0)

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

In [206]:
df.drop(['one','three'],axis=1,inplace=True)
df

   two  four
0   10  1000
1   20  2000
2   30  3000
3   40  4000

# Transposing a DataFrame
The .T attribute in a Pandas DataFrame is used to transpose the dataframe, i.e., to flip the rows and columns. The result of transposing a dataframe is a new dataframe with the original rows as columns and the original columns as rows.

Here's an example to illustrate the use of the .T attribute:

In [209]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [210]:
df.T

          0     1     2     3
one       1     2     3     4
two      10    20    30    40
three   100   200   300   400
four   1000  2000  3000  4000

# A set of more DataFrame Functionalities

In [211]:
data = { 'one'   : pd.Series([1, 2, 3, 4]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 300, 400]),
         'four'  : pd.Series([1000, 2000, 3000, 4000])}
df = pd.DataFrame(data)

1. axes function
- The .axes attribute in a Pandas DataFrame returns a list with the row and column labels of the DataFrame. The first element of the list is the row labels (index), and the second element is the column labels.

In [220]:
df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

2. ndim function
- The .ndim attribute in a Pandas DataFrame returns the number of dimensions of the dataframe, which is always 2 for a DataFrame (row-and-column format).

In [221]:
df.ndim

2

3. dtypes
- The .dtypes attribute in a Pandas DataFrame returns the data types of the columns in the DataFrame. The result is a Series with the column names as index and the data types of the columns as values.

In [223]:
df.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

4. shape function
- The .shape attribute in a Pandas DataFrame returns the dimensions (number of rows, number of columns) of the DataFrame as a tuple.

In [224]:
df.shape

(4, 4)

5. head() function
- The .head() method in a Pandas DataFrame returns the first n rows (by default, n=5) of the DataFrame. This method is useful for quickly examining the first few rows of a large DataFrame to get a sense of its structure and content.

In [233]:
d = { 'Name'  :pd.Series(['Tom','Jerry','Spike','Popeye','Olive','Bluto','Mickey']),
      'Age'   :pd.Series([10,12,14,30,28,33,15]),
      'Height':pd.Series([3.25,1.11,4.12,5.47,6.15,6.67,2.61])}

df = pd.DataFrame(d)
df

     Name  Age  Height
0     Tom   10    3.25
1   Jerry   12    1.11
2   Spike   14    4.12
3  Popeye   30    5.47
4   Olive   28    6.15
5   Bluto   33    6.67
6  Mickey   15    2.61

In [228]:
df.head(2)

    Name  Age  Height
0    Tom   10    3.25
1  Jerry   12    1.11

6. df.tail() function
- The .tail() method in a Pandas DataFrame returns the last n rows (by default, n=5) of the DataFrame. This method is useful for quickly examining the last few rows of a large DataFrame to get a sense of its structure and content.

In [229]:
df.tail(2)

     Name  Age  Height
5   Bluto   33    6.67
6  Mickey   15    2.61

7. empty function()
- The .empty attribute in a Pandas DataFrame returns a Boolean value indicating whether the DataFrame is empty or not. A DataFrame is considered empty if it has no rows.

In [231]:
df = pd.DataFrame()

df.empty

True

# Statistical or Mathematical Functions
## Sum   ,Mean   ,Median   ,Mode   ,Variance   ,Min   ,Max   ,Standard Deviation

In [234]:
data = {'one'   : pd.Series([1, 2, 3, 4]),
        'two'   : pd.Series([10, 20, 30, 40]),
        'three' : pd.Series([100, 200, 300, 400]),
        'four'  : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [235]:
df.sum()

one         10
two        100
three     1000
four     10000
dtype: int64

In [236]:
df.mean()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [237]:
df.median()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [242]:
de = pd.DataFrame({'A': [1, 2, 2, 3, 4, 4, 4, 5], 'B': [10, 20, 20, 30, 40, 40, 50, 60]})

print('A' , de['A'].mode())
print()
print('B' , de['B'].mode())

A 0    4
Name: A, dtype: int64

B 0    20
1    40
Name: B, dtype: int64

In [246]:
df.var()

one      1.666667e+00
two      1.666667e+02
three    1.666667e+04
four     1.666667e+06
dtype: float64

In [249]:
df.std()

one         1.290994
two        12.909944
three     129.099445
four     1290.994449
dtype: float64

In [250]:
df.min()

one         1
two        10
three     100
four     1000
dtype: int64

In [251]:
df.max()

one         4
two        40
three     400
four     4000
dtype: int64

# Describe Function
- The describe() method in a Pandas DataFrame returns descriptive statistics of the data in the DataFrame. It provides a quick summary of the central tendency, dispersion, and shape of the distribution of a set of numerical data.

- The default behavior of describe() is to compute descriptive statistics for all numerical columns in the DataFrame. If you want to compute descriptive statistics for a specific column, you can pass the name of the column as an argument.

In [253]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000]),
        'five' : pd.Series(['A','B','C','D'])}


df = pd.DataFrame(data)
df.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

# Pipe Functions
1. Pipe Function

The pipe() method in a Pandas DataFrame allows you to apply a function to the DataFrame, similar to the way the apply() method works. The difference is that pipe() allows you to chain multiple operations together by passing the output of one function to the input of the next function.

In [258]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
def mean_(i):
    return i.mean()

def sqr_(i):
    return i**2
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [260]:
df.pipe(mean_).pipe(sqr_)

one            6.25
two          625.00
three      62500.00
four     6250000.00
dtype: float64

2. Apply Function
- The apply() method in a Pandas DataFrame allows you to apply a function to the DataFrame, either to individual elements or to the entire DataFrame. The function can be either a built-in Python function or a user-defined function.

In [261]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [263]:
df.apply(np.max)

one         4
two        40
three     400
four     4000
dtype: int64

In [264]:
df.apply(lambda x: x.max() - x.min())

one         3
two        30
three     300
four     3000
dtype: int64

3. Apply map function
- The map() method in a Pandas DataFrame allows you to apply a function to each element of a specific column of the DataFrame. The function can be either a built-in Python function or a user-defined function.

In [268]:
df.applymap(np.max)

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

applymap and apply are both functions in the pandas library used for applying a function to elements of a pandas DataFrame or Series.

applymap is used to apply a function to every element of a DataFrame. It returns a new DataFrame where each element has been modified by the input function.

apply is used to apply a function along any axis of a DataFrame or Series. It returns either a Series or a DataFrame, depending on the axis along which the function is applied and the return value of the function. Unlike applymap, apply can take into account the context of the data, such as the row or column label.

So, applymap is meant for element-wise operations while apply can be used for both element-wise and row/column-wise operations.

In [276]:
df = pd.DataFrame({ 'A': [1.2, 3.4, 5.6], 
                    'B': [7.8, 9.1, 2.3]})
df
df.applymap(np.int64)

   A  B
0  1  7
1  3  9
2  5  2

3. Reindex Function
- The reindex function in Pandas is used to change the row labels and/or column labels of a DataFrame. This function can be used to align data from multiple DataFrames or to update the labels based on new data. The function takes in a list or an array of new labels as its first argument and, optionally, a fill value to replace any missing values. The reindexing can be done along either the row axis (0) or the column axis (1). The reindexed DataFrame is returned.

In [285]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
print(df)
print("--"*20)
df.reindex([1,2,3,0])

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
----------------------------------------

   one  two  three  four
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
0    1   10    100  1000

In [287]:
df.reindex(columns=["two","three","one","four"])

   two  three  one  four
0   10    100    1  1000
1   20    200    2  2000
2   30    300    3  3000
3   40    400    4  4000

# Renaming Columns in Pandas DataFrame
- The rename function in Pandas is used to change the row labels and/or column labels of a DataFrame. It can be used to update the names of one or multiple rows or columns by passing a dictionary of new names as its argument. The dictionary should have the old names as keys and the new names as values

In [291]:
data = {'one'  : pd.Series([1, 2, 3, 4]),
        'two'  : pd.Series([10, 20, 30, 40]),
        'three': pd.Series([100, 200, 300, 400]),
        'four' : pd.Series([1000, 2000, 3000, 4000])}

df = pd.DataFrame(data)
print(df)
print("--"*20)
df.rename(columns = {'one' : 'One','two': 'Two', 'three' : 'Three', 'four' : 'Four'}, 
           inplace = True, index = {0:'a',1:'b',2:'c',4:'d'})
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
----------------------------------------

   One  Two  Three  Four
a    1   10    100  1000
b    2   20    200  2000
c    3   30    300  3000
3    4   40    400  4000

# Sorting in Pandas DataFrame
- Pandas provides several methods to sort a DataFrame based on one or more columns.

- sort_values: This method sorts the DataFrame based on one or more columns. The default sorting order is ascending, but you can change it to descending by passing the ascending argument with a value of False.

In [294]:
data = { 'one'   : pd.Series([11, 51, 31, 41]),
         'two'   : pd.Series([10, 20, 30, 40]),
         'three' : pd.Series([100, 200, 500, 400]),
         'four'  : pd.Series([10000, 2000, 30000, 4000])}

df = pd.DataFrame(data)
df

   one  two  three   four
0   11   10    100  10000
1   51   20    200   2000
2   31   30    500  30000
3   41   40    400   4000

In [296]:
df.sort_values(by="four",ascending=False)

   one  two  three   four
2   31   30    500  30000
0   11   10    100  10000
3   41   40    400   4000
1   51   20    200   2000

# Groupby Functions
The groupby function in pandas is used to split a dataframe into groups based on one or more columns. It returns a DataFrameGroupBy object, which is similar to a DataFrame but has some additional methods to perform operations on the grouped data.

In [306]:
cricket = {'Team'   : ['India', 'India', 'Australia', 'Australia', 'SA', 'SA', 'SA', 'SA', 'NZ', 'NZ', 'NZ', 'India'],
           'Rank'   : [2, 3, 1,2, 3,4 ,1 ,1,2 , 4,1,2],
           'Year'   : [2014,2014,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
           'Points' : [876,801,891,815,776,784,834,824,758,691,883,782]}

df = pd.DataFrame(cricket)
df

         Team  Rank  Year  Points
0       India     2  2014     876
1       India     3  2014     801
2   Australia     1  2014     891
3   Australia     2  2015     815
4          SA     3  2014     776
5          SA     4  2015     784
6          SA     1  2016     834
7          SA     1  2017     824
8          NZ     2  2016     758
9          NZ     4  2014     691
10         NZ     1  2015     883
11      India     2  2017     782

In [307]:
df.groupby("Team").groups

{'Australia': [2, 3], 'India': [0, 1, 11], 'NZ': [8, 9, 10], 'SA': [4, 5, 6, 7]}

In [308]:
df.groupby(["Team","Year"]).get_group(("India",2014))

    Team  Rank  Year  Points
0  India     2  2014     876
1  India     3  2014     801

In [316]:
# using sum in group by 
"""
select sum(points) from df
group by team
"""
print(df.groupby("Team")['Points'].sum())
print()
df.groupby("Team").sum()['Points']

Team
Australia    1706
India        2459
NZ           2332
SA           3218
Name: Points, dtype: int64

Team
Australia    1706
India        2459
NZ           2332
SA           3218
Name: Points, dtype: int64

In [318]:
df.groupby("Team").sum()['Points'].sort_values(ascending=False)

Team
SA           3218
India        2459
NZ           2332
Australia    1706
Name: Points, dtype: int64

In [325]:
groups = df.groupby("Team")
print(type(groups['Points']))
groups['Points'].agg([sum,max,min,np.mean,np.median,np.std,np.var])

<class 'pandas.core.groupby.generic.SeriesGroupBy'>

            sum  max  min        mean  median        std          var
Team
Australia  1706  891  815  853.000000   853.0  53.740115  2888.000000
India      2459  876  782  819.666667   801.0  49.702448  2470.333333
NZ         2332  883  691  777.333333   758.0  97.449132  9496.333333
SA         3218  834  776  804.500000   804.0  28.769196   827.666667

# filter function

In [327]:
df.groupby("Team").filter(lambda x: len(x) == 3)

     Team  Rank  Year  Points
0   India     2  2014     876
1   India     3  2014     801
8      NZ     2  2016     758
9      NZ     4  2014     691
10     NZ     1  2015     883
11  India     2  2017     782

# Working with csv and basic data analysis using python